codeboxqc/Tezos-hub75-esp32/esp32/src/web.cpp
#include "web.h"
#include <Arduino.h>
#include <Preferences.h>
#include <HTTPClient.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>

// External references from main.cpp
extern int artCount;
extern int currentIndex;
extern void displayNext();
extern void saveCurrentOriginal();
extern void fetchPlaylist();
extern void triggerServerUpdate();
extern uint32_t rotateTimer;
extern uint32_t sec15;

void resetWiFiConfig();

extern MatrixPanel_I2S_DMA *display;
extern Art collection[];

// Global config instance
WebConfig webConfig = {
    "user",                                    // ssid
    "pass",                                    // password
    "https://paradox.ovh/led-art/nfts.json",  // playlistUrl
    "https://paradox.ovh/led-art/update.php", // updateUrl
    "",                                        // favoriteAddress
    40000,                                     // rotateTimer
    12000,                                     // textDelay
    255,                                       // brightness
    false                                      // showFavoritesOnly
};

Preferences preferences;

// HTML Configuration Page
const char CONFIG_PAGE[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Tezos Art Wall Control</title>
    <style>
        * { margin: 0; padding: 0; box-sizing: border-box; }
        body {
            font-family: 'Segoe UI', system-ui, sans-serif;
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            min-height: 100vh;
            padding: 20px;
            color: #fff;
        }
        .container { max-width: 900px; margin: 0 auto; }
        .header { text-align: center; margin-bottom: 30px; }
        .header h1 {
            font-size: 2.5em;
            text-shadow: 2px 2px 4px rgba(0,0,0,0.3);
            margin-bottom: 10px;
        }
        .status {
            display: inline-block;
            background: rgba(255,255,255,0.2);
            padding: 5px 15px;
            border-radius: 20px;
            font-size: 0.9em;
        }
        .panel {
            background: rgba(255,255,255,0.95);
            border-radius: 15px;
            padding: 25px;
            margin-bottom: 20px;
            box-shadow: 0 8px 32px rgba(0,0,0,0.2);
            color: #333;
        }
        .panel h2 {
            color: #667eea;
            margin-bottom: 20px;
            font-size: 1.3em;
            border-bottom: 2px solid #667eea;
            padding-bottom: 10px;
        }
        .current-art {
            background: linear-gradient(135deg, #667eea15, #764ba215);
            padding: 20px;
            border-radius: 10px;
            margin-bottom: 20px;
        }
        .art-title {
            font-size: 1.4em;
            font-weight: bold;
            color: #667eea;
            margin-bottom: 5px;
        }
        .art-artist { color: #666; margin-bottom: 10px; }
        .art-price {
            display: inline-block;
            background: #4CAF50;
            color: white;
            padding: 5px 12px;
            border-radius: 5px;
            font-weight: bold;
        }
        .control-group { margin-bottom: 20px; }
        .control-group label {
            display: block;
            font-weight: 600;
            margin-bottom: 8px;
            color: #555;
        }
        .control-group input[type="number"],
        .control-group input[type="text"],
        .control-group input[type="password"] {
            width: 100%;
            padding: 12px;
            border: 2px solid #ddd;
            border-radius: 8px;
            font-size: 1em;
            transition: border-color 0.3s;
        }
        .control-group input:focus {
            outline: none;
            border-color: #667eea;
        }
        .slider-container {
            display: flex;
            align-items: center;
            gap: 15px;
        }
        .slider {
            flex: 1;
            height: 8px;
            border-radius: 5px;
            background: #ddd;
            outline: none;
            -webkit-appearance: none;
        }
        .slider::-webkit-slider-thumb {
            -webkit-appearance: none;
            width: 24px;
            height: 24px;
            border-radius: 50%;
            background: #667eea;
            cursor: pointer;
        }
        .slider-value {
            min-width: 60px;
            text-align: right;
            font-weight: bold;
            color: #667eea;
        }
        .button-grid {
            display: grid;
            grid-template-columns: repeat(auto-fit, minmax(140px, 1fr));
            gap: 12px;
            margin-top: 20px;
        }
        .btn {
            padding: 15px 20px;
            border: none;
            border-radius: 8px;
            font-size: 1em;
            font-weight: 600;
            cursor: pointer;
            transition: all 0.3s;
            text-align: center;
        }
        .btn:hover {
            transform: translateY(-2px);
            box-shadow: 0 4px 12px rgba(0,0,0,0.2);
        }
        .btn-primary {
            background: linear-gradient(135deg, #667eea, #764ba2);
            color: white;
        }
        .btn-success { background: #4CAF50; color: white; }
        .btn-warning { background: #ff9800; color: white; }
        .btn-danger { background: #f44336; color: white; }
        .stats-grid {
            display: grid;
            grid-template-columns: repeat(auto-fit, minmax(200px, 1fr));
            gap: 15px;
        }
        .stat-card {
            background: linear-gradient(135deg, #667eea15, #764ba215);
            padding: 15px;
            border-radius: 8px;
            text-align: center;
        }
        .stat-value {
            font-size: 2em;
            font-weight: bold;
            color: #667eea;
        }
        .stat-label {
            color: #666;
            margin-top: 5px;
            font-size: 0.9em;
        }
        .checkbox-container {
            display: flex;
            align-items: center;
            gap: 10px;
        }
        .checkbox-container input[type="checkbox"] {
            width: 20px;
            height: 20px;
            cursor: pointer;
        }
    </style>
</head>
<body>
    <div class="container">
        <div class="header">
            <h1>🎨 Tezos Art Wall</h1>
            <div class="status" id="statusBadge">🟢 Connected</div>
        </div>

        <div class="panel">
            <h2>📺 Now Showing</h2>
            <div class="current-art">
                <div class="art-title" id="currentTitle">Loading...</div>
                <div class="art-artist" id="currentArtist">by Artist</div>
                <span class="art-price" id="currentPrice">--</span>
            </div>
            <div class="button-grid">
                <button class="btn btn-primary" onclick="nextImage()">⏭️ Next</button>
                <button class="btn btn-success" onclick="saveImage()">💾 Save</button>
                <button class="btn btn-danger" onclick="refreshPlaylist()">🔄 Refresh</button>
            </div>
        </div>

        <div class="panel">
            <h2>⚙️ Display Settings</h2>
            <div class="control-group">
                <label>⏱️ Rotation Time (seconds)</label>
                <div class="slider-container">
                    <input type="range" class="slider" min="5" max="300" value="40" id="rotationSlider" oninput="updateRotation(this.value)">
                    <span class="slider-value" id="rotationValue">40s</span>
                </div>
            </div>
            <div class="control-group">
                <label>💡 Brightness</label>
                <div class="slider-container">
                    <input type="range" class="slider" min="16" max="255" value="255" id="brightnessSlider" oninput="updateBrightness(this.value)">
                    <span class="slider-value" id="brightnessValue">255</span>
                </div>
            </div>
            <div class="control-group">
                <label>📺 Text Scroll Delay (seconds)</label>
                <div class="slider-container">
                    <input type="range" class="slider" min="0" max="60" value="12" id="textDelaySlider" oninput="updateTextDelay(this.value)">
                    <span class="slider-value" id="textDelayValue">12s</span>
                </div>
            </div>
            <div class="button-grid">
                <button class="btn btn-success" onclick="saveSettings()">💾 Save Settings</button>
            </div>
        </div>

        <div class="panel">
            <h2>🌐 WiFi Configuration</h2>
            <div class="control-group">
                <label>Network SSID</label>
                <input type="text" id="wifiSSID" placeholder="Enter WiFi name">
            </div>
            <div class="control-group">
                <label>Password</label>
                <input type="password" id="wifiPassword" placeholder="Enter WiFi password">
            </div>
            <div class="button-grid">
                <button class="btn btn-primary" onclick="saveWiFiConfig()">💾 Save WiFi</button>
                <button class="btn btn-danger" onclick="resetWiFi()">🔄 Reset & AP Mode</button>
            </div>
        </div>

        <div class="panel">
            <h2>📊 System Status</h2>
            <div class="stats-grid">
                <div class="stat-card">
                    <div class="stat-value" id="artCount">0</div>
                    <div class="stat-label">Artworks Loaded</div>
                </div>
                <div class="stat-card">
                    <div class="stat-value" id="freeHeap">-- KB</div>
                    <div class="stat-label">Free RAM</div>
                </div>
                <div class="stat-card">
                    <div class="stat-value" id="uptime">--</div>
                    <div class="stat-label">Uptime</div>
                </div>
                <div class="stat-card">
                    <div class="stat-value" id="wifiSignal">-- dBm</div>
                    <div class="stat-label">WiFi Signal</div>
                </div>
            </div>
        </div>
    </div>

    <script>
        window.onload = function() {
            loadStatus();
            loadConfig();
            setInterval(loadStatus, 5000);
        };

        function loadStatus() {
            fetch('/api/status')
                .then(r => r.json())
                .then(data => {
                    document.getElementById('currentTitle').textContent = data.title || 'No artwork';
                    document.getElementById('currentArtist').textContent = 'by ' + (data.artist || 'Unknown');
                    document.getElementById('currentPrice').textContent = data.price || '--';
                    document.getElementById('artCount').textContent = data.artCount || 0;
                    document.getElementById('freeHeap').textContent = Math.round(data.freeHeap / 1024) + ' KB';
                    document.getElementById('uptime').textContent = formatUptime(data.uptime);
                    document.getElementById('wifiSignal').textContent = data.wifiRSSI + ' dBm';
                })
                .catch(e => console.error('Status error:', e));
        }

