codeboxqc/Tezos-hub75-esp32/esp32/src/web.cpp
        function loadConfig() {
            fetch('/api/config')
                .then(r => r.json())
                .then(data => {
                    document.getElementById('wifiSSID').value = data.ssid || '';
                    document.getElementById('rotationSlider').value = data.rotateTimer / 1000;
                    document.getElementById('rotationValue').textContent = (data.rotateTimer / 1000) + 's';
                    document.getElementById('textDelaySlider').value = data.textDelay / 1000;
                    document.getElementById('textDelayValue').textContent = (data.textDelay / 1000) + 's';
                    document.getElementById('brightnessSlider').value = data.brightness;
                    document.getElementById('brightnessValue').textContent = data.brightness;
                })
                .catch(e => console.error('Config error:', e));
        }

        function formatUptime(ms) {
            const s = Math.floor(ms / 1000);
            const h = Math.floor(s / 3600);
            const m = Math.floor((s % 3600) / 60);
            return h + 'h ' + m + 'm';
        }

        function updateRotation(val) {
            document.getElementById('rotationValue').textContent = val + 's';
            fetch('/api/set?rotation=' + val);
        }

        function updateBrightness(val) {
            document.getElementById('brightnessValue').textContent = val;
            fetch('/api/set?brightness=' + val);
        }

        function updateTextDelay(val) {
            document.getElementById('textDelayValue').textContent = val + 's';
            fetch('/api/set?textDelay=' + val);
        }

        function saveSettings() {
            fetch('/api/saveSettings')
                .then(r => r.text())
                .then(msg => alert('💾 ' + msg));
        }

        function nextImage() {
            fetch('/api/next');
            setTimeout(loadStatus, 1000);
        }

        function saveImage() {
            fetch('/api/save').then(r => r.text()).then(msg => alert('💾 ' + msg));
        }

        function refreshPlaylist() {
            fetch('/api/refresh');
            alert('🔄 Refreshing...');
            setTimeout(loadStatus, 2000);
        }

        function saveWiFiConfig() {
            const ssid = document.getElementById('wifiSSID').value;
            const pass = document.getElementById('wifiPassword').value;
            
            if (!ssid) {
                alert('⚠️ Enter WiFi SSID');
                return;
            }

            fetch('/api/saveWiFi', {
                method: 'POST',
                headers: {'Content-Type': 'application/json'},
                body: JSON.stringify({ssid: ssid, password: pass})
            })
            .then(r => r.text())
            .then(msg => alert('💾 ' + msg + '\n\nRestarting...'));
        }

        function resetWiFi() {
            if (!confirm('Reset WiFi?\n\nWill restart in AP mode.')) return;
            fetch('/api/resetWiFi')
                .then(r => r.text())
                .then(msg => alert('🔄 ' + msg));
        }
    </script>
</body>
</html>
)rawliteral";

// Load configuration from flash - CHECKS ON BOOT
void handleLoadConfig() {
    if (!preferences.begin("artwall", true)) {  // Read-only mode first
        Serial.println("⚠️  Failed to open preferences for reading");
        preferences.end();
        
        // Try to initialize with defaults
        if (preferences.begin("artwall", false)) {
            preferences.putString("ssid", "");
            preferences.putString("password", "");
            preferences.putString("playlist", "https://paradox.ovh/led-art/nfts.json");
            preferences.putString("update", "https://paradox.ovh/led-art/update.php");
            preferences.putString("favorite", "");
            preferences.putUInt("rotateTime", 40000);
            preferences.putUInt("textDelay", 12000);
            preferences.putUChar("brightness", 255);
            preferences.putBool("favOnly", false);
            preferences.putBool("configured", false);  // Mark as not configured
            preferences.end();
            Serial.println("✓ Initialized preferences with defaults");
        }
        return;
    }
    
    // Check if system has been configured before
    bool isConfigured = preferences.getBool("configured", false);
    
    String ssid = preferences.getString("ssid", "");
    String password = preferences.getString("password", "");
    String playlist = preferences.getString("playlist", "https://paradox.ovh/led-art/nfts.json");
    String update = preferences.getString("update", "https://paradox.ovh/led-art/update.php");
    String favorite = preferences.getString("favorite", "");
    
    strlcpy(webConfig.ssid, ssid.c_str(), 32);
    strlcpy(webConfig.password, password.c_str(), 64);
    strlcpy(webConfig.playlistUrl, playlist.c_str(), 128);
    strlcpy(webConfig.updateUrl, update.c_str(), 128);
    strlcpy(webConfig.favoriteAddress, favorite.c_str(), 64);
    
    webConfig.rotateTimer = preferences.getUInt("rotateTime", 40000);
    webConfig.textDelay = preferences.getUInt("textDelay", 12000);
    webConfig.brightness = preferences.getUChar("brightness", 255);
    webConfig.showFavoritesOnly = preferences.getBool("favOnly", false);
    
    // Apply loaded settings to runtime
    rotateTimer = webConfig.rotateTimer;
    sec15 = webConfig.textDelay;
    if (display) {
        display->setBrightness8(webConfig.brightness);
    }
    
    preferences.end();
    
    if (isConfigured && ssid.length() > 0) {
        Serial.println("✓ Configuration loaded from ESP32:");
        Serial.printf("  SSID: '%s'\n", webConfig.ssid);
        Serial.printf("  Brightness: %d\n", webConfig.brightness);
        Serial.printf("  Rotation: %d ms\n", webConfig.rotateTimer);
        Serial.printf("  Text Delay: %d ms\n", webConfig.textDelay);
    } else {
        Serial.println("⚠️  No saved configuration found - waiting for user setup");
        Serial.println("   Connect to AP mode and configure WiFi settings");
    }
}

// Reset WiFi credentials
void resetWiFiConfig() {
    if (!preferences.begin("artwall", false)) {
        Serial.println("Failed to open preferences for WiFi reset");
        return;
    }
    
    preferences.putString("ssid", "");
    preferences.putString("password", "");
    preferences.putBool("configured", false);
    preferences.end();
    
    Serial.println("WiFi credentials cleared");
}

// Handle status request
void handleGetStatus(AsyncWebServerRequest *request) {
    static char jsonBuffer[512];
    
    const char* title = (artCount > 0 && currentIndex >= 0 && currentIndex < artCount) 
                        ? collection[currentIndex].title : "No artwork";
    const char* artist = (artCount > 0 && currentIndex >= 0 && currentIndex < artCount) 
                         ? collection[currentIndex].artist : "Unknown";
    const char* price = (artCount > 0 && currentIndex >= 0 && currentIndex < artCount) 
                        ? collection[currentIndex].price : "--";
    
    snprintf(jsonBuffer, sizeof(jsonBuffer),
        "{\"title\":\"%s\",\"artist\":\"%s\",\"price\":\"%s\","
        "\"artCount\":%d,\"currentIndex\":%d,\"freeHeap\":%d,"
        "\"uptime\":%lu,\"wifiRSSI\":%d}",
        title, artist, price, artCount, currentIndex,
        ESP.getFreeHeap(), millis(), WiFi.RSSI()
    );
    
    request->send(200, "application/json", jsonBuffer);
}

