codeboxqc/Tezos-hub75-esp32/esp32/src/web.cpp
// Handle config request
void handleAPI(AsyncWebServerRequest *request) {
    static char jsonBuffer[512];
    
    snprintf(jsonBuffer, sizeof(jsonBuffer),
        "{\"ssid\":\"%s\",\"playlistUrl\":\"%s\",\"updateUrl\":\"%s\","
        "\"favoriteAddress\":\"%s\",\"showFavoritesOnly\":%s,"
        "\"rotateTimer\":%u,\"textDelay\":%u,\"brightness\":%u}",
        webConfig.ssid, webConfig.playlistUrl, webConfig.updateUrl,
        webConfig.favoriteAddress, 
        webConfig.showFavoritesOnly ? "true" : "false",
        webConfig.rotateTimer, webConfig.textDelay, webConfig.brightness
    );
    
    request->send(200, "application/json", jsonBuffer);
}

// Safe JSON parsing helper
bool extractJsonString(const String& json, const char* key, char* output, size_t maxLen) {
    String searchKey = String("\"") + key + "\":\"";
    int start = json.indexOf(searchKey);
    if (start == -1) return false;
    
    start += searchKey.length();
    int end = json.indexOf("\"", start);
    if (end == -1) return false;
    
    String value = json.substring(start, end);
    strlcpy(output, value.c_str(), maxLen);
    return true;
}

bool extractJsonInt(const String& json, const char* key, uint32_t& output) {
    String searchKey = String("\"") + key + "\":";
    int start = json.indexOf(searchKey);
    if (start == -1) return false;
    
    start += searchKey.length();
    int end = json.indexOf(",", start);
    if (end == -1) end = json.indexOf("}", start);
    if (end == -1) return false;
    
    output = json.substring(start, end).toInt();
    return true;
}

// Setup web server routes
void setupWebServer(AsyncWebServer* server) {
    // Main page
    server->on("/", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send(200, "text/html", CONFIG_PAGE);
    });
    
    // API endpoints
    server->on("/api/status", HTTP_GET, handleGetStatus);
    server->on("/api/config", HTTP_GET, handleAPI);
    
    server->on("/api/next", HTTP_GET, [](AsyncWebServerRequest *request){
        displayNext();
        request->send(200, "text/plain", "Next image");
    });
    
    server->on("/api/save", HTTP_GET, [](AsyncWebServerRequest *request){
        saveCurrentOriginal();
        request->send(200, "text/plain", "Saved!");
    });
    
    server->on("/api/refresh", HTTP_GET, [](AsyncWebServerRequest *request){
        triggerServerUpdate();
        fetchPlaylist();
        request->send(200, "text/plain", "Refreshed");
    });
    
    // Runtime updates (temporary, not saved)
    server->on("/api/set", HTTP_GET, [](AsyncWebServerRequest *request){
        if (request->hasParam("rotation")) {
            rotateTimer = request->getParam("rotation")->value().toInt() * 1000;
            webConfig.rotateTimer = rotateTimer;
        }
        if (request->hasParam("brightness")) {
            uint8_t val = request->getParam("brightness")->value().toInt();
            if (display) display->setBrightness8(val);
            webConfig.brightness = val;
        }
        if (request->hasParam("textDelay")) {
            sec15 = request->getParam("textDelay")->value().toInt() * 1000;
            webConfig.textDelay = sec15;
        }
        request->send(200, "text/plain", "OK");
    });
    
    // NEW: Save settings to ESP32 flash
    server->on("/api/saveSettings", HTTP_GET, [](AsyncWebServerRequest *request){
        if (!preferences.begin("artwall", false)) {
            request->send(500, "text/plain", "Storage error");
            return;
        }
        
        // Save current runtime values to flash
        preferences.putUInt("rotateTime", rotateTimer);
        preferences.putUInt("textDelay", sec15);
        preferences.putUChar("brightness", webConfig.brightness);
        preferences.putBool("configured", true);  // Mark as configured
        
        preferences.end();
        
        Serial.println("✓ Settings saved to ESP32 flash");
        request->send(200, "text/plain", "Settings saved to ESP32!");
    });
    
    // WiFi save - Saves and restarts
    server->on("/api/saveWiFi", HTTP_POST, [](AsyncWebServerRequest *request){}, NULL,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total){
        
        // Build string from data
        String body;
        body.reserve(len + 1);
        for (size_t i = 0; i < len; i++) {
            body += (char)data[i];
        }
        
        char ssid[32] = {0};
        char password[64] = {0};
        
        if (!extractJsonString(body, "ssid", ssid, sizeof(ssid))) {
            request->send(400, "text/plain", "Invalid JSON");
            return;
        }
        
        extractJsonString(body, "password", password, sizeof(password));
        
        if (!preferences.begin("artwall", false)) {
            request->send(500, "text/plain", "Storage error");
            return;
        }
        
        preferences.putString("ssid", ssid);
        preferences.putString("password", password);
        preferences.putBool("configured", true);  // Mark as configured
        preferences.end();
        
        Serial.printf("✓ WiFi saved to ESP32: SSID='%s'\n", ssid);
        request->send(200, "text/plain", "WiFi saved to ESP32");
        
        delay(500);
        ESP.restart();
    });
    
    // WiFi reset
    server->on("/api/resetWiFi", HTTP_GET, [](AsyncWebServerRequest *request){
        resetWiFiConfig();
        request->send(200, "text/plain", "WiFi reset - restarting");
        delay(500);
        ESP.restart();
    });
    
    Serial.println("✓ Web server configured");
}

// Save configuration to flash (legacy function - can be called manually)
void handleSaveConfig(AsyncWebServerRequest *request) {
    preferences.begin("artwall", false);
    
    if (request->hasParam("playlistUrl", true)) {
        String url = request->getParam("playlistUrl", true)->value();
        preferences.putString("playlist", url);
        strlcpy(webConfig.playlistUrl, url.c_str(), 128);
    }
    
