codeboxqc/Tezos-hub75-esp32/esp32/src/web.cpp
    if (request->hasParam("updateUrl", true)) {
        String url = request->getParam("updateUrl", true)->value();
        preferences.putString("update", url);
        strlcpy(webConfig.updateUrl, url.c_str(), 128);
    }
    
    if (request->hasParam("favoriteAddress", true)) {
        String addr = request->getParam("favoriteAddress", true)->value();
        preferences.putString("favorite", addr);
        strlcpy(webConfig.favoriteAddress, addr.c_str(), 64);
    }
    
    if (request->hasParam("showFavoritesOnly", true)) {
        bool val = request->getParam("showFavoritesOnly", true)->value() == "true";
        preferences.putBool("favOnly", val);
        webConfig.showFavoritesOnly = val;
    }
    
    if (request->hasParam("rotateTimer", true)) {
        uint32_t val = request->getParam("rotateTimer", true)->value().toInt();
        preferences.putUInt("rotateTime", val);
        webConfig.rotateTimer = val;
        rotateTimer = val;
    }
    
    if (request->hasParam("textDelay", true)) {
        uint32_t val = request->getParam("textDelay", true)->value().toInt();
        preferences.putUInt("textDelay", val);
        webConfig.textDelay = val;
        sec15 = val;
    }
    
    if (request->hasParam("brightness", true)) {
        uint8_t val = request->getParam("brightness", true)->value().toInt();
        preferences.putUChar("brightness", val);
        webConfig.brightness = val;
        display->setBrightness8(val);
    }
    
    preferences.putBool("configured", true);
    preferences.end();
    
    request->send(200, "text/plain", "Configuration saved successfully");
}